snlkuharlocal/src/Catalogs/РазмерыЧашки/РазмерыЧашки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РазмерыЧашки</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НаименованиеЧестногоЗнака</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

snlkuharlocal/src/InformationRegisters/ЗначенияСвойствОбъектов/ЗначенияСвойствОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗначенияСвойствОбъектов</name>
  <comment>(Общ)</comment>
  <resources>
    <name>Значение</name>
    <comment>(Общ)</comment>
    <type>
      <types>Characteristic.СвойстваОбъектов</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <comment>(Общ)</comment>
    <type>
      <types>DocumentRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Свойство</name>
    <comment>(Общ)</comment>
    <type>
      <types>ChartOfCharacteristicTypesRef.СвойстваОбъектов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Catalogs/РазмерыЧашки/ManagerModule.bsl
Функция ПолучитьЗначенияСвойств(РазмерЧашки) Экспорт

	
	Запрос = Новый Запрос;
	запрос.Текст= "ВЫБРАТЬ
	              |	ЗначенияСвойствОбъектов.Свойство КАК Свойство,
	              |	ЗначенияСвойствОбъектов.Значение КАК Значение
	              |ИЗ
	              |	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	              |ГДЕ
	              |	ЗначенияСвойствОбъектов.Объект = &Объект";
	
	Запрос.УстановитьПараметр("Объект", 	РазмерЧашки);
	
	тСвойства = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаС Из тСвойства Цикл
		СтрокаС.Значение = СтрокаС.Свойство.ТипЗначения.ПривестиЗначение(СтрокаС.Значение);		
	КонецЦикла;
	
	Возврат тСвойства;

КонецФункции //ПолучитьЗначенияСвойствНК(Модель) Экспорт
